ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_exti.h
/* EXTI_INTEN1 */
#define EXTI_INTEN1_INTEN32           BIT(0)                         /*!< interrupt from line 32 */
#define EXTI_INTEN1_INTEN33           BIT(1)                         /*!< interrupt from line 33 */
#define EXTI_INTEN1_INTEN34           BIT(2)                         /*!< interrupt from line 34 */
#define EXTI_INTEN1_INTEN35           BIT(3)                         /*!< interrupt from line 35 */
#define EXTI_INTEN1_INTEN36           BIT(4)                         /*!< interrupt from line 36 */
#define EXTI_INTEN1_INTEN37           BIT(5)                         /*!< interrupt from line 37 */

/* EXTI_EVEN1 */
#define EXTI_EVEN1_EVEN32             BIT(0)                         /*!< event from line 32 */
#define EXTI_EVEN1_EVEN33             BIT(1)                         /*!< event from line 33 */
#define EXTI_EVEN1_EVEN34             BIT(2)                         /*!< event from line 34 */
#define EXTI_EVEN1_EVEN35             BIT(3)                         /*!< event from line 35 */
#define EXTI_EVEN1_EVEN36             BIT(4)                         /*!< event from line 36 */
#define EXTI_EVEN1_EVEN37             BIT(5)                         /*!< event from line 37 */

/* EXTI_RTEN1 */
#define EXTI_RTEN1_RTEN32             BIT(0)                         /*!< rising edge from line 32 */
#define EXTI_RTEN1_RTEN33             BIT(1)                         /*!< rising edge from line 33 */
#define EXTI_RTEN1_RTEN34             BIT(2)                         /*!< rising edge from line 34 */
#define EXTI_RTEN1_RTEN35             BIT(3)                         /*!< rising edge from line 35 */
#define EXTI_RTEN1_RTEN36             BIT(4)                         /*!< rising edge from line 36 */
#define EXTI_RTEN1_RTEN37             BIT(5)                         /*!< rising edge from line 37 */

/* EXTI_FTEN1 */
#define EXTI_FTEN1_FTEN32             BIT(0)                         /*!< falling edge from line 32 */
#define EXTI_FTEN1_FTEN33             BIT(1)                         /*!< falling edge from line 33 */
#define EXTI_FTEN1_FTEN34             BIT(2)                         /*!< falling edge from line 34 */
#define EXTI_FTEN1_FTEN35             BIT(3)                         /*!< falling edge from line 35 */
#define EXTI_FTEN1_FTEN36             BIT(4)                         /*!< falling edge from line 36 */
#define EXTI_FTEN1_FTEN37             BIT(5)                         /*!< falling edge from line 37 */

/* EXTI_SWIEV1 */
#define EXTI_SWIEV1_SWIEV32           BIT(0)                         /*!< software interrupt/event request from line 32 */
#define EXTI_SWIEV1_SWIEV33           BIT(1)                         /*!< software interrupt/event request from line 33 */
#define EXTI_SWIEV1_SWIEV34           BIT(2)                         /*!< software interrupt/event request from line 34 */
#define EXTI_SWIEV1_SWIEV35           BIT(3)                         /*!< software interrupt/event request from line 35 */
#define EXTI_SWIEV1_SWIEV36           BIT(4)                         /*!< software interrupt/event request from line 36 */
#define EXTI_SWIEV1_SWIEV37           BIT(5)                         /*!< software interrupt/event request from line 37 */

/* EXTI_PD1 */
#define EXTI_PD1_PD32                 BIT(0)                         /*!< interrupt pending status from line 32 */
#define EXTI_PD1_PD33                 BIT(1)                         /*!< interrupt pending status from line 33 */
#define EXTI_PD1_PD34                 BIT(2)                         /*!< interrupt pending status from line 34 */
#define EXTI_PD1_PD35                 BIT(3)                         /*!< interrupt pending status from line 35 */
#define EXTI_PD1_PD36                 BIT(4)                         /*!< interrupt pending status from line 36 */
#define EXTI_PD1_PD37                 BIT(5)                         /*!< interrupt pending status from line 37 */

/* constants definitions */
/* define the EXTI bit position and its register group index offset */
#define EXTI_GROUPIDX_BIT(groupidx, bitpos)      (((uint32_t)(groupidx) << 8U) | (uint32_t)(bitpos))
#define EXTI_REG_VAL(linex)                      (EXTI + ((uint32_t)(linex) >> 8U))
#define EXTI_BIT_POS(linex)                      BIT((uint32_t)(linex) & 0x1FU)

/* define the EXTI register groups*/
#define EXTI_GROUP0_OFFSET                       0x00000000U                                         /*!< the index offset of EXTI group0 */
#define EXTI_GROUP1_OFFSET                       0x00000018U                                         /*!< the index offset of EXTI group1 */

/* define the registers in the group*/
#define EXTI_INTEN(exti_group)                   REG32((uint32_t)(exti_group) + 0x00000000U)         /*!< the index offset of register INTEN in the registe group */
#define EXTI_EVEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x00000004U)         /*!< the index offset of register EVEN in the registe group */
#define EXTI_RTEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x00000008U)         /*!< the index offset of register RTEN in the registe group */
#define EXTI_FTEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x0000000CU)         /*!< the index offset of register FTEN in the registe group */
#define EXTI_SWIEV(exti_group)                   REG32((uint32_t)(exti_group) + 0x00000010U)         /*!< the index offset of register SWIEV in the registe group */
#define EXTI_PD(exti_group)                      REG32((uint32_t)(exti_group) + 0x00000014U)         /*!< the index offset of register PD in the registe group */

/* EXTI line number */
typedef enum {
    EXTI_0      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 0U),    /*!< EXTI line 0 */
    EXTI_1      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 1U),    /*!< EXTI line 1 */
    EXTI_2      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 2U),    /*!< EXTI line 2 */
    EXTI_3      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 3U),    /*!< EXTI line 3 */
    EXTI_4      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 4U),    /*!< EXTI line 4 */
    EXTI_5      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 5U),    /*!< EXTI line 5 */
    EXTI_6      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 6U),    /*!< EXTI line 6 */
    EXTI_7      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 7U),    /*!< EXTI line 7 */
    EXTI_8      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 8U),    /*!< EXTI line 8 */
    EXTI_9      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 9U),    /*!< EXTI line 9 */
    EXTI_10     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 10U),   /*!< EXTI line 10 */
    EXTI_11     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 11U),   /*!< EXTI line 11 */
    EXTI_12     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 12U),   /*!< EXTI line 12 */
    EXTI_13     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 13U),   /*!< EXTI line 13 */
    EXTI_14     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 14U),   /*!< EXTI line 14 */
    EXTI_15     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 15U),   /*!< EXTI line 15 */
    EXTI_16     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 16U),   /*!< EXTI line 16 */
    EXTI_17     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 17U),   /*!< EXTI line 17 */
    EXTI_18     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 18U),   /*!< EXTI line 18 */
    EXTI_19     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 19U),   /*!< EXTI line 19 */
    EXTI_20     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 20U),   /*!< EXTI line 20 */
    EXTI_21     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 21U),   /*!< EXTI line 21 */
    EXTI_22     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 22U),   /*!< EXTI line 22 */
    EXTI_23     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 23U),   /*!< EXTI line 23 */
    EXTI_24     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 24U),   /*!< EXTI line 24 */
    EXTI_25     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 25U),   /*!< EXTI line 25 */
    EXTI_26     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 26U),   /*!< EXTI line 26 */
    EXTI_27     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 27U),   /*!< EXTI line 27 */
    EXTI_28     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 28U),   /*!< EXTI line 28 */
    EXTI_29     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 29U),   /*!< EXTI line 29 */
    EXTI_30     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 30U),   /*!< EXTI line 30 */
    EXTI_31     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 31U),   /*!< EXTI line 31 */
    EXTI_32     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 32U),   /*!< EXTI line 32 */
    EXTI_33     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 33U),   /*!< EXTI line 33 */
    EXTI_34     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 34U),   /*!< EXTI line 34 */
    EXTI_35     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 35U),   /*!< EXTI line 35 */
    EXTI_36     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 36U),   /*!< EXTI line 36 */
    EXTI_37     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 37U)    /*!< EXTI line 37 */
} exti_line_enum;

